{"pageProps":{"page":{"title":"/canon","slug":"canon","description":"Ideas and content that shaped my thinking","updatedAt":"2025-11-12","order":3,"content":"<h1>Canon</h1>\n<h2>Essential Reading</h2>\n<p>Books, articles, and essays that fundamentally changed how I think.</p>\n<h3>Books</h3>\n<ul>\n<li><a href=\"https://en.wikipedia.org/wiki/Maverick_(book)\">Maverick! : The Success Story Behind the World's Most Unusual Workplace</a> by Ricardo Semler</li>\n</ul>\n<p>As I moved from an individual contributor to a manager, this book was always the anchor I turned to for guidance.</p>\n<blockquote>\n<p>The best way to encourage people to think and act independently is to let them make decisions and live with the consequences.</p>\n</blockquote>\n<blockquote>\n<p>We have absolute faith in people’s ability to make sensible decisions if given the information they need.</p>\n</blockquote>\n<blockquote>\n<p>The way to stay innovative is to give people the freedom to question everything — including your own decisions.</p>\n</blockquote>\n<blockquote>\n<p>Trust is the ultimate form of control.</p>\n</blockquote>\n<ul>\n<li><a href=\"https://en.wikipedia.org/wiki/The_Happiness_Hypothesis\">The Happiness Hypothesis</a> by Jonathan Haidt</li>\n</ul>\n<p>This book was the first that managed to captivate me while bridging science with Ancient Wisdom. I know it is seen as a pop self-help book, but it did have a tremendous positive impact on how I see the world.</p>\n<blockquote>\n<p>Happiness is not something that you can find, acquire, or achieve directly. You have to get the conditions right and then wait. Some of those conditions are within you ... Other conditions require relationships to things beyond you: Just as plants need sun, water, and good soil to thrive, people need love, work, and a connection to something larger.</p>\n</blockquote>\n<blockquote>\n<p>Each of us thinks we see the world directly, as it really is. We further believe that the facts as we see them are there for all to see, therefore others should agree with us. If they don’t agree… it follows either that they have not yet been exposed to the relevant facts or else that they are blinded by their interests and ideologies.</p>\n</blockquote>\n<ul>\n<li><a href=\"https://en.wikipedia.org/wiki/Drive:_The_Surprising_Truth_About_What_Motivates_Us\">Drive: The Surprising Truth About What Motivates Us</a> by Daniel H. Pink</li>\n</ul>\n<p>Autonomy, Mastery, Purpose. The trifecta I always strived to give my teams.</p>\n<blockquote>\n<p>People have a deep desire to be self-directed. Once that desire is satisfied, they produce better work and are more fulfilled.</p>\n</blockquote>\n<blockquote>\n<p>The desire to improve is far more powerful than any carrot or stick.</p>\n</blockquote>\n<blockquote>\n<p>The most deeply motivated people are motivated by something larger than themselves.</p>\n</blockquote>\n<h3>Essays &#x26; Articles</h3>\n<ul>\n<li><a href=\"https://assets.sbnation.com/assets/1074301/Valve_Handbook_LowRes.pdf\">VALVe - Handbook for New Employees</a> (pdf)</li>\n</ul>\n<p>Not really an essay or an Article, or at least I don't believe it was intended as such when published, this handbook was a huge influence in how I influenced the work culture everywhere I worked at.</p>\n<blockquote>\n<p>When you give smart, talented people the freedom to create without fear of failure, amazing things happen.</p>\n</blockquote>\n<blockquote>\n<p>Hiring is the most important thing in the universe. Nothing else comes close.</p>\n</blockquote>\n<blockquote>\n<p>Sometimes the right thing to do is to stop doing something you’re passionate about — because it’s not helping our customers.</p>\n</blockquote>\n<blockquote>\n<p>The best ideas can come from anywhere. The trick is to recognize them when they do.</p>\n</blockquote>\n<blockquote>\n<p>Every Valve employee is a designer. Every Valve employee is a tester. Every Valve employee is a decision-maker.</p>\n</blockquote>\n<h3>Talks &#x26; Videos</h3>\n<ul>\n<li><a href=\"https://youtu.be/PgTEsybXw-4?si=QmKmW5_iBnrSjjQo\">The Finisher: Jasmin Paris and the Barkley Marathons (Full Documentary)</a> (46:44)</li>\n</ul>\n<p>A video that is entertaining while showing how far we can go when we focus on something. I shed a coupl eof tears every time I see it.</p>\n<ul>\n<li><a href=\"https://youtu.be/Df_K7pIsfvg?si=TynupSrDoUnuOikx\">Cabel Sasser, Panic - XOXO Festival (2024)</a> (19:25)</li>\n</ul>\n<blockquote>\n<p>Appreciate everything endlessly</p>\n</blockquote>\n<blockquote>\n<p>Go down all the rabbit holes</p>\n</blockquote>\n<ul>\n<li><a href=\"https://youtu.be/UF8uR6Z6KLc?si=W-VDQnsoeHmmYnmI\">Steve Jobs' 2005 Stanford Commencement Address</a> (15:04)</li>\n</ul>\n<blockquote>\n<p>Death is very likely the single best invention of Life. It is Life’s change agent. It clears out the old to make way for the new.</p>\n</blockquote>\n"}},"__N_SSG":true}