{"pageProps":{"project":{"title":"LinkedCare EHR and PHR","description":"(CTPO at Crowdcare) Personal Health Record (PHR) and Electronic Health Record (EHR)","technologies":["Python","TypeScript","Tailwind"],"link":"https://github.com/yourusername/project1","image":"/images/linkedcare.png","featured":true,"content":"<h2>Overview</h2>\n<p>As CTO and Head of Product at Crowdcare, I led the development of a Personal Health Record and Electronic Health Record (EHR) solution, initially focused on private healthcare providers in Portugal and later expanded to the US market.</p>\n<h2>Key Features</h2>\n<p><img src=\"/images/cembe.png\" alt=\"ProLinkedcare\"></p>\n<ul>\n<li><strong>Scalable micro-services architecture</strong>: Built a scalable architecture with 10s of micro-services communicating trough a resilient queue system.</li>\n<li><strong>Real-time Mecical decision support system</strong>: Trough a logical inference service combined with a socket based UI we achieved a real-time desision support system that warned about potential heallth risks (like conflict of medications) or advised exam or analysis perscriptions, leaving the doctor free to focus on patient communication and enabling single press treatment selection.</li>\n<li><strong>Remote face to face consultations</strong>: Created a real-time video conferencing system that allowed patients to consult with their doctors remotely, integrating different UIs and data analysys in each side, allowing both for the patient to easely digest the information and for the doctor to reduce the data input time by automatically parsing and categorizing the data from the patient interaction.</li>\n<li><strong>Annonymous medication data processing</strong>: Developed a platform that collected medication prescription, utilization and outcomes into a data lake and provided health intervineants with real-time insights and analytics.</li>\n</ul>\n<h2>Technical Details</h2>\n<h3>Architecture</h3>\n<p>The system is built on a microservices architecture using:</p>\n<ul>\n<li>Ruby microservices;</li>\n<li>Rails framework from client applications;</li>\n<li>RabbitMQ as a message broker;</li>\n<li>Native iOS and Android clients.</li>\n</ul>\n<p><img src=\"/images/mylinkedcare.png\" alt=\"MyLinkedcare\"></p>\n"}},"__N_SSG":true}