{"pageProps":{"page":{"title":"/blogroll","slug":"blogroll","description":"Blogs and websites I read regularly","updatedAt":"2025-11-12","order":2,"content":"<h1>Blogroll</h1>\n<h2>Blogs (RSS feeds) I Follow</h2>\n<p>I mostly use RSS feeds to follow blogs and websites, so that's what I'm sharing here.\nMy RSS reader of choince both on Mac and iOS is <a href=\"https://reederapp.com/\">Reeder</a>.</p>\n<p>I also read my favorite newsletters trough my RSS feed using <a href=\"https://kill-the-newsletter.com/\">Kill the Newsletter!</a></p>\n<h3>Technology</h3>\n<ul>\n<li>\n<p>By far my main source of tech related news is <a href=\"https://news.ycombinator.com/\">Hacker News</a>.\nI use the RSS feeds from <a href=\"https://hnrss.github.io/\">https://hnrss.github.io/</a> mainly:</p>\n<ul>\n<li><a href=\"https://hnrss.org/active\">Active</a></li>\n<li><a href=\"https://hnrss.org/frontpage\">Front Page</a></li>\n<li><a href=\"https://hnrss.org/newest\">Newest</a></li>\n<li><a href=\"https://hnrss.org/best\">Best</a></li>\n<li><a href=\"https://hnrss.org/bestcomments\">Best Comments</a></li>\n</ul>\n</li>\n<li>\n<p><a href=\"https://simonwillison.net/\">Simon Willison’s Weblog</a> a great source of news and insights on everything related with AI development.</p>\n</li>\n<li>\n<p><a href=\"https://www.therundown.ai/\">The Rundown AI</a> My favorite daily newsletter on everything AI.</p>\n</li>\n<li>\n<p><a href=\"https://www.theneurondaily.com/\">The Neuron</a> My second favorite daily newsletter on everything AI.</p>\n</li>\n<li>\n<p><a href=\"https://daringfireball.net/\">Daring Fireball</a> Insights into the Apple ecosystem.</p>\n</li>\n<li>\n<p><a href=\"https://tomtunguz.com/\">Tomasz Tunguz</a> Tomasz is a tech VC who writes very well and always offers great, data-driven insights into what’s happening in tech.</p>\n</li>\n<li>\n<p><a href=\"https://engineering.atspotify.com/\">Spotify Engineering</a> Always fascinated with their technical posts.</p>\n</li>\n<li>\n<p><a href=\"https://www.oneusefulthing.org/\">One Useful Thing</a> Prof. Ethan Mollik always writes very thoughtfull articles on the Implications of AI.</p>\n</li>\n<li>\n<p><a href=\"https://www.macstories.net/\">MacStories</a> Federico Viticci, John Voorhees, and the rest of the MacStories crew always have the best content on the Apple ecosystem.</p>\n</li>\n</ul>\n<h3>Gamming</h3>\n<p>I have always been fascinated by the gaming world. Nowadays, I don’t play much, but I still enjoy keeping up with what’s happening and often find inspiration in this world for my day-to-day work.</p>\n<ul>\n<li><a href=\"https://wavelengths.online/\">Wavelengths</a> Brandon is a game aficionado and a great writer.</li>\n<li><a href=\"https://www.polygon.com/\">Polygon</a> A generalist gaming site.</li>\n<li><a href=\"https://metalgamesolid.com/\">Metal Game Solid</a> Metal Game Solid is a recent website that focuses on retro gaming news (a sub-genre I'm really fond of)</li>\n</ul>\n<h3>Lego</h3>\n<p>I'm what nowadays is called an AFOL (Adult Fan of LEGO)...</p>\n<ul>\n<li><a href=\"https://www.brothers-brick.com/about/\">The Brothers Brick</a> Probably the best blog covering the Adult LEGO fans world.</li>\n<li><a href=\"https://brickset.com/\">Brickset</a> Primarly a database of LEGO sets they are also very fast at reporting on LEGo related news.</li>\n</ul>\n<h3>Other</h3>\n<ul>\n<li><a href=\"https://newsletter.newsminimalist.com/\">News Minimalist</a> An interesting experiment, they crawl 30K plus news articles per day and give them a significance score, surfacing daily the handful that are most significant.</li>\n<li><a href=\"https://www.densediscovery.com/\">Dense Discovery</a> I don't know how to describe this newsletter but I know I love it. Maybe the best way is to quote Kai, the author:</li>\n</ul>\n<blockquote>\n<p>I now send a weekly newsletter that curates a mix of the practical and contemplative, highlighting paths toward a more considered existence online and in real life – one that resists the pull of the attention merchants.</p>\n</blockquote>\n"}},"__N_SSG":true}