{"pageProps":{"project":{"title":"Trend Highlighter","description":"(personal project) Surface the most relevant and trending content from the Farcaster social network.","technologies":["Python","TypeScript","Tailwind"],"link":"https://trendhighlighter.xyz","image":"/images/trendhighlighter.png","featured":true,"content":"<h1>Building a Real-time Link Aggregator for Farcaster</h1>\n<h2>1. Introduction</h2>\n<p>The <a href=\"https://trendhighlighter.xyz\">Farcaster Trend Highlighter</a> is a web application designed to surface the most relevant and trending content from the Farcaster social network. It addresses the challenge of information overload by aggregating and analyzing link-sharing patterns within user networks and custom groups.</p>\n<p>Key challenges this project tackles:</p>\n<ul>\n<li>Real-time data collection and processing from the Farcaster network</li>\n<li>Efficient storage and retrieval of social graph data</li>\n<li>Intelligent content aggregation and trend detection</li>\n<li>Scalable background processing for continuous updates</li>\n</ul>\n<h2>2. Architecture Overview</h2>\n<p>The application is built on a modern stack designed for scalability and real-time processing. At its core, it utilizes FastAPI, PostgreSQL, and Redis for caching and real-time data processing. The system is containerized using Docker, which ensures consistent deployment across environments.</p>\n<p>A key architectural decision was the implementation of Celery for background task processing, allowing us to handle time-consuming operations like data synchronization without impacting the user experience. This is complemented by Prometheus monitoring, giving us insights into system performance and helping identify bottlenecks.</p>\n<h2>3. Core Technical Features</h2>\n<h3>3.1 Efficient Data Collection</h3>\n<p>We use the excelent Neynar API to fetch data from the Farcaster network. Our implementation uses Redis for efficient caching, ensuring data freshness and reducing API calls (and costs).:</p>\n<div class=\"remark-highlight\"><pre class=\"language-python\"><code class=\"language-python\"><span class=\"token keyword\">class</span> <span class=\"token class-name\">FarcasterClient</span><span class=\"token punctuation\">:</span>\n    <span class=\"token keyword\">def</span> <span class=\"token function\">__init__</span><span class=\"token punctuation\">(</span>self<span class=\"token punctuation\">)</span><span class=\"token punctuation\">:</span>\n        self<span class=\"token punctuation\">.</span>api_key <span class=\"token operator\">=</span> os<span class=\"token punctuation\">.</span>getenv<span class=\"token punctuation\">(</span><span class=\"token string\">\"NEYNAR_API_KEY\"</span><span class=\"token punctuation\">)</span>\n        self<span class=\"token punctuation\">.</span>base_url <span class=\"token operator\">=</span> <span class=\"token string\">\"https://api.neynar.com/v2\"</span>\n        \n        <span class=\"token comment\"># Initialize Redis connection with TTL-based caching</span>\n        redis_url <span class=\"token operator\">=</span> os<span class=\"token punctuation\">.</span>getenv<span class=\"token punctuation\">(</span><span class=\"token string\">\"REDIS_URL\"</span><span class=\"token punctuation\">,</span> <span class=\"token string\">\"redis://redis:6379/0\"</span><span class=\"token punctuation\">)</span>\n        self<span class=\"token punctuation\">.</span>redis<span class=\"token punctuation\">:</span> Redis <span class=\"token operator\">=</span> redis<span class=\"token punctuation\">.</span>from_url<span class=\"token punctuation\">(</span>redis_url<span class=\"token punctuation\">)</span>\n        self<span class=\"token punctuation\">.</span>cache_ttl <span class=\"token operator\">=</span> <span class=\"token number\">300</span>  <span class=\"token comment\"># 5 minutes cache TTL</span>\n        \n        <span class=\"token comment\"># Maintain a single aiohttp session for connection pooling</span>\n        self<span class=\"token punctuation\">.</span>session <span class=\"token operator\">=</span> <span class=\"token boolean\">None</span>\n</code></pre></div>\n<h3>3.2 Intelligent Content Processing</h3>\n<p>One of the most interesting challenges was implementing intelligent URL extraction and processing. Our system can identify and categorize different types of content, from simple text links to embedded media. We developed an algorithm that not only extracts URLs but also analyzes their context and metadata.</p>\n<p>The system handles various edge cases, such as duplicate URLs across different casts, embedded media content, and URL normalization. It also implements smart filtering to exclude image URLs and other media content that doesn't contribute to trend analysis.</p>\n<h3>3.3 Real-time Updates</h3>\n<p>The real-time update system utilizes a combination of background tasks and event-driven architecture. Celery workers continuously process user timelines, while the main application maintains real-time connections with clients through efficient database queries and caching strategies.</p>\n<h3>3.4 Performance Optimizations</h3>\n<p>Our performance optimization strategy focuses on three key areas: database query optimization, caching strategies, and efficient data structures. We use carefully crafted database indices, materialized views for complex aggregations, and a multi-level caching system that balances data freshness with response time.</p>\n<h2>4. User Management and Authentication</h2>\n<p>The authentication system integrates with Neynar's OAuth flow while maintaining its own user management system. This hybrid approach allows us to leverage Farcaster's authentication while maintaining control over user permissions and features. The system includes plan management, allowing for different levels of access and features based on user subscriptions.</p>\n<h2>6. Deployment and Monitoring</h2>\n<p>Our deployment strategy utilizes Docker Compose for orchestrating multiple services, including the main application, Celery workers, Redis, and PostgreSQL. The system includes comprehensive monitoring through Prometheus, with custom metrics for tracking API usage, cache hit rates, and background task performance.</p>\n<h2>7. Advanced Features</h2>\n<p>The application includes several advanced features, such as custom user lists for tracking specific groups of Farcaster users, trend analysis across different time windows, and intelligent content categorization. These features are implemented with scalability in mind, using efficient database queries and caching strategies.</p>\n<h2>8. Technical Challenges and Solutions</h2>\n<p>Throughout development, we encountered and solved several significant challenges:</p>\n<ul>\n<li>Implementing efficient rate limiting while maintaining data freshness</li>\n<li>Designing a scalable database schema for social graph data</li>\n<li>Building a reliable background processing system</li>\n<li>Managing cache invalidation across multiple services</li>\n</ul>\n"}},"__N_SSG":true}